// 1. Название мероприятия
val eventname: String = "Monster Hackaton"
// 2. Дата проведения
var eventdate: String = "10 ноября 2025"
// 3. Место проведения
var eventplace: String = "Название места"
// 4. Подробный бюджет мероприятия, включая расходы на оборудование, кейтеринг и другие операционные расходы
private val eventbudget: String = "подробная информация с перечислением поставщиков и сумм для внутреннего пользования"
// 5. Количество участников
var eventmembers: Int = 0
// 6. Длительность хакатона
val eventtime: Int = 3
// 7. Контактная информация и условия соглашений с поставщиками пищи, оборудования и других услуг
private const val: String = "Contact info and Suppliers Terms and Conditions"
// 8. Текущее состояние хакатона (статус)
var eventstatus: String = "Registration is open"
// 9. Список спонсоров
val eventsponsors: String = "Sponsors list"
// 10. Бюджет мероприятия
private val: Int = 3000000
// 11. Текущий уровень доступа к интернету
var internetacceslevel: String = "high"
// 12. Информация о транспортировке оборудования, распределении ресурсов и координации между различными командами поддержки
private val: String = "Documentation"
// 13. Количество команд
var eventteamsnumber: Int = 0
// 14. Перечень задач
val eventtodolist: String = "To do list"
// 15. План эвакуации
var eventevacuationplan: String = "Evacuation plan"
// 16. Список доступного оборудования (всё, что выделено для использования на мероприятии)
val eventequipment: String = "list of available equipment"
// 17. Список свободного оборудования (всё, что можно взять прямо сейчас и что не занято другими участниками)
var evenfreetequipment: String = "list of free equipment"
// 18. График питания участников (зависит от поставщика питания, определяемого за неделю до начала)
lateinit var mealSchedule: String
// 19. План мероприятий на случай сбоев
val eventdisruptionsplan: String = "Contingency plan for disruptions"
// 20. Список экспертов и жюри
var eventexpertslist: String = "List of experts and jury"
// 21. Политика конфиденциальности
val eventprivacypolicy: String = "Privacy Policy"
// 22. Приватные отзывы (фидбэк) участников и зрителей для анализа проблем
private lateinit var: String = "Privat feedback"
// 23. Текущая температура в помещении

// 24. Данные мониторинга и анализ производительности сетевого оборудования и интернет-соединения для целей отладки своих приложений командами

// 25. Регулятор скорости интернета (понижающий коэффициент, например 0.5)

// 26. Уровень освещения

// 27. Лог событий мероприятия

// 28. Возможность получения медицинской помощи прямо на мероприятии (да/нет)

// 29. Планы и процедуры для обеспечения безопасности мероприятия, включая планы эвакуации и протоколы чрезвычайных ситуаций

// 30. Регистрационный номер мероприятия

// 31. Максимально допустимый уровень шума в помещении хакатона

// 32. Индикатор превышения уровня шума в помещениях (превышен или не превышен в данный момент)

// 33. План взаимодействия с прессой

// 34. Детальная публичная информация о проектах каждой команды, сбор данных включает в себя компиляцию кода и сбор статистики прогона автоматизированных проверок

// 35. Статус получения всех необходимых разрешений для проведения мероприятия

// 36. Индикатор доступности специализированного оборудования в данный момент (например, специальному оборудованию)

// 37. Список партнеров мероприятия

// 38. Отчет, включающий фотографии, видео и отзывы, генерируется и становится доступен после завершения мероприятия

// 39. Внутренние правила распределения призов

// 40. Список разыгрываемых призов

// 41. Контактная информация экстренных служб, медицинского персонала и других важных служб, для внутреннего пользования

// 42. Особые условия для участников с ограниченными возможностями

// 43. Общее настроение участников (определяется опросами)

// 44. Подробный план хакатона, включающий время и содержание каждого сегмента, инициализируется непосредственно перед началом мероприятия, так как зависит от фактического состава команд и взятых в работу задач

// 45. Имя знаменитого специального гостя, которое будет объявлено за день до мероприятия, но в момент инициализации неизвестно

// 46. Максимальное количество людей, которое может вместить место проведения

// 47. Количество часов, отведенное каждой команде для работы над проектом




